// Function to show proverbs in the modal
function showProverbs(category) {
    const modal = document.getElementById('proverb-modal');
    const proverbContentArea = document.getElementById('proverb-content-area');
  
    // Clear the modal content area
    proverbContentArea.innerHTML = '';
  
    // Example proverbs data for each category (now only titles)
    const proverbsData = {
      'education': [
        "Ауру қалса да, Әдет қалмайды", 
        "Өлімнен ұят күшті", 
        "Алдыңғы көш қайдан жүрсе, Соңғы көш сонан жүрер", 
        "Қарағайға қарап тал өсер, Құрбысына қарап бала өсер",
        "Су ішкен құдығыңа түкірме!", "Балапан ұяда не көрсе, Ұшқанда соны алады", 
        "Келінім саған айтам, Қызым сен тыңда", 
        "Сабыр түбі сары алтын", 
        "Сырлы аяқтың сыры кетсе де, Сыны кетпейді.", "Бала тәрбиесі бесіктен", 
        "Ұлық болсаң — кішік бол.", "Жүзден - жүйрік, Мыңнан - тұлпар", 
        "Ананың ізін қыз басар, Атаның ізін ұл басар"
      ],
      'homeland': [
        "Отаны бірдің жүрегі бір, Жүрегі бірдің тілегі бір", 
        "Азат елдің аспаны ашық", 
        "Туған жердей жер болмас, туған елдей ел болмас", 
        "Отан елдің анасы, Ел ердің анасы", 
        "Ел іші - алтын бесік", 
        "Отансыз адам — ормансыз бұлбұл", 
        "Отан оттан да ыстық, жалыны бар шоқтан да ыстық", 
        "Отан отбасынан басталады", 
        "Отан қадіріне жетпеген өз қадіріне жетпейді", 
        "Жауда қалған бұлбұлдан Отанға қайтқан ит артық", 
        "Бұлбұл гүлзарын сүйеді, Адал адам Отанын сүйеді", 
        "Опасызда oтан жоқ", 
        "Отан — отбасынан басталады"
      ],
      'education1' :[
        "Білетінің бір тоғыз, Білмейтінің тоқсан тоғыз", "Білмесең үндеме, Білгенді күндеме", 
        "Білім гауһар бағасы жоқ, Надандық кесел дауасы жоқ", 
        "Киіміне қарап қарсы алады, Біліміне қарап шығарып салады", 
        "Күш - білімде, білім - кітапта", "Қына тасқа бітеді, Білім басқа бітеді", 
        "Білегі күшті бірді жығады, Білімі күшті мыңды жығады", 
        "Өз білмегеніңді кісіден сұра, Үлкен жоқ болса кішіден сұра", 
        "Ақыл - тозбайтын тон", "Білім – таусылмайтын кен", "Білім арзан, білу қымбат", 
        "Жаста оқыған оқуың - тасқа жазғанмен бірдей, Егде тартқанда оқыған оқуың - мұзға жазғанмен бірдей", "Екпей егін шықпас, Үйренбей білім жұқпас", 
        "Наданмен дос болғанша, Кітаппен дос бол", 
        "Мың малың болғанша, бір балаң ғалым болсын", 
        "Ғылыммен жақын болсаң, қолың жетер, Залыммен жақын болсаң, басың кетер", 
        "Жеті жұрттың тілін біл, Жеті түрлі білім біл", "Оқымаған бір бала, Оқыса екі бала", "Ұстаздан шәкірт озар", "Алтын алма, білім ал", 
        "Ғылым - теңіз, білім - қайық", "Тіліңмен жүгірме, біліммен жүгір", 
        "Көп жасаған білмейді, көп көрген біледі", "Білімді өлсе, Қағазда аты қалар, Ұста өлсе, Істеген заты қалар", 
        "Өнер - ағып жатқан бұлақ, Ілім - жанып тұрған шырақ", "Білімді бесіктен тесікке дейін ізден", 
        "Жердің сәні - егін, Ердің сәні - білім", "Өмірдің өзі - ұлы ұстаз", "Білім басы - бейнет, соңы - зейнет", "Ілім - бұлақ, Білім - шырақ", "Оқусыз білім жоқ, Білімсіз күнің жоқ"
        ],
      'unity': [
        "Білімнің басы - бейнет, соңы - зейнет", 
        "Сыртқы жаудан ішкі жау жаман", "Айрылыссаң - азарсың, қосылсаң - озарсың", 
        "Айрылғанды аю асайды, бүлінгенді бөрі асайды", "Алтау ала болса, ауыздағы кетеді, Төртеу түгел болса, төбедегі келеді", 
        "Алты бақан, ала ауыз", "Әрне көрсең тірлікте, сыйласқан жақсы бірлікте", "Байлық, байлық емес, бірлік байлық", 
        "Бөлінгенді бөрі жейді, жарылғанды жау жейді", "Бір жеңнен қол шығар, бір жағадан бас шығар", "Бірлік бар жерде - тірлік бар", 
        "Бірлігі жоқтың тірлігі жоқ", "Біреуің бас, біреуің аяқ бол, біреуің құйрық, біреуің қанат бол", "Біріккен жүз, бытыраңқы мыңды алады", 
        "Бірлік жоқ болса, ұйым жоқ", "Ұйым жоқ болса, күйің жоқ"
      ],
      'behavior': [
        "Дәніккеннен құныққан жаман", "Балуанның жаманы, Жығылған соң қалтырар, Күзетшінің жаманы, Алдырған соң талтаяр", 
        "Құс жаманы саңғығыш, Адам жаманы қаңғығыш", "Жаманға ошақтың үш бұты, Үш айлық жол", 
        "Шөлдің қамысы болмайды, Жаманның намысы болмайды", 
        "Жапа шегіп, жай жату Жасықтықтың белгісі, Ерте жатып, кеш тұру Пасықтықтың белгісі", "Күтімі жаман ағаштың Бітімі жаман", 
        "Жаман өзен өткел бермес, Жаман кісі көпке ермес", 
        "Бейілі жаман кісіден көшеді, Өз асын өзі жасырып ішеді", "Үндемес ауызда пәле бар, Екі ұртында шала бар", 
        "Тақыр жерге су төксең, Жүруге тайғақ болар", 
        "Жаманға сырыңды айтсаң, Тар жерде айғақ болар", 
        "Атың жаман болса, Қарың кетер, Балаң жаман болса, Арың кетер", "Жаманның ойыны жаман Шошқаның мойыны жаман.", 
        "Қайта жауған қар жаман, Қайта шапқан жау жаман, Жаманның аттан құлағаны да жаман."
            ],
      'kinship': [
        "Ырыс қашса да, туыс қашпайды", "Асу-асу белдер бар, аса алмай жаудың аты өлсін, Ағайынмен тату бол, айыра алмай жат өлсін", "Ағайын тату болса ат көп болар, Абысын тату болса ас көп болар", "Әкесін сыйламаған кісіні баласы сыйламайды", "Ағаның үйі - ақ жайлау", "Ағайын тату болса ат көп, Абысын тату болса ас көп", "Ағайынның азары болса да, безері болмас", "Ағайын өкпеге қиса да, өлімге қимайды", "Ағайын - ағайынның айнасы", "Ағайының барда дұшпаным жоқ деме, Абысының барда күндесім жоқ деме", "Алыста жүрсе, кісінескен ағайын, Жақында жүрсе, тістескен ағайын", "Ағайынның сырты бүтін, іші түтін", "Көсеу ұзын болса, қол күймес, Ағайынның алғанын, жақыны білмес жат білер", "Малыңның жоқтығын ағайының білдіреді, Қадіріңнің жоқтығын қатының білдіреді"
      ],
      'work': [
        "Ұстаны соққан пышағынан танисың", "Қой егіз тапса, шөптің басы айыр шығады", 
        "Қалауын тапса, қар жанар", "Қолы білген құм үстінен кеме жүргізер" ,
        "Күшіңе сенбе, ісіңе сен"
      ],
      'courage': [
        "Арманы жоқ жігіттің дәрмені жоқ", "Жет қырлы балықты, сегіз қырлы жігіт алады", 
        "Ерді намыс өлтірер,Қоянды қамыс өлтірер", "Ер қартайса, қазаншы болады, Бүркіт қартайса, тышқаншы болады" ,
        "Ер қанаты — ат"
      ]
    };
  
    if (proverbsData[category]) {
        proverbsData[category].forEach(proverb => {
          const proverbDiv = document.createElement('div');
          proverbDiv.classList.add('tradition');
    
          // Check if the proverb contains a comma and split it
          if (proverb.includes(',')) {
            const lines = proverb.split(',');
            proverbDiv.innerHTML = `<h3>${lines[0]},</h3><h3>${lines[1]}</h3><hr>`;
          } else {
            proverbDiv.innerHTML = `<h3>${proverb}</h3><hr>`;
          }
    
          proverbContentArea.appendChild(proverbDiv);
        });
    
        // Display the modal
        modal.style.display = 'block';
      }
    }
    
    // Close the modal when "X" is clicked
    document.getElementById('close-proverb-modal').onclick = function () {
      document.getElementById('proverb-modal').style.display = 'none';
    }
    
    // Close the modal when clicking anywhere outside of the modal content
    window.onclick = function(event) {
      const modal = document.getElementById('proverb-modal');
      if (event.target === modal) {
        modal.style.display = 'none';
      }
    }
  